Masmiseim36/nxpSDK/boards/frdmkv11z/bootloader_examples/demo_apps/led_demo_freedom_a000/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD6 (number 63), J2[6]/LD1[1]/PTD6
  @{ */
#define BOARD_LED_RED_FGPIO FGPIOD /*!<@brief FGPIO device name: FGPIOD */
#define BOARD_LED_RED_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_RED_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_RED_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                 /* @} */

/*! @name PORTE29 (number 17), J1[13]/J1[14]/LD1[4]/PTE29
  @{ */
#define BOARD_LED_GREEN_FGPIO FGPIOE /*!<@brief FGPIO device name: FGPIOE */
#define BOARD_LED_GREEN_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_GREEN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_LED_GREEN_PIN 29U    /*!<@brief PORTE pin index: 29 */
                                   /* @} */

/*! @name PORTE25 (number 21), J1[5]/J1[12]/LD1[3]/U9[4]/PTE25
  @{ */
#define BOARD_LED_BLUE_FGPIO FGPIOE /*!<@brief FGPIO device name: FGPIOE */
#define BOARD_LED_BLUE_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_BLUE_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_LED_BLUE_PIN 25U    /*!<@brief PORTE pin index: 25 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
